Repository: pauljohanneskraft/UML
Catalog: Sources/AcaiApp/Resources/Localizable.xcstrings
Source language: en
Languages: de, fr

# View.GitHubAccountSection.CopiedClipboard
source: Copied to clipboard
de: In die Zwischenablage kopiert
fr: Copié dans le presse-papiers

# View.GitHubAccountSection.EnterCodeLinkBelow
source: Enter this code at the link below:
de: Gib diesen Code über den folgenden Link ein:
fr: Saisissez ce code sur le lien ci-dessous :

# View.GitHubAccountSection.Open %@
source: Open %@
de: %@ öffnen
fr: Ouvrir %@

# View.GitHubAccountSection.PasteFineGrainedPersonal
source: Paste a fine-grained personal access token scoped to Contents: Read-only —
de: Füge ein fine-grained Personal Access Token mit dem Scope Contents: Read-only ein —
fr: Collez un personal access token à granularité fine limité à Contents: Read-only —

# View.GitHubAccountSection.RefreshScopes
source: Refresh Scopes
de: Scopes aktualisieren
fr: Actualiser les scopes

# View.GitHubAccountSection.SignGitHub
source: Sign in with GitHub
de: Mit GitHub anmelden
fr: Se connecter avec GitHub

# View.GitHubAccountSection.SignOut
source: Sign Out
de: Abmelden
fr: Se déconnecter

# View.GitHubAccountSection.SignToken
source: Sign In with Token
de: Mit Token anmelden
fr: Se connecter avec un token

# View.GitHubAccountSection.TokenExpired
source: Your token has expired. Sign in again to keep pulling from GitHub.
de: Dein Token ist abgelaufen. Melde dich erneut an, um weiter von GitHub zu pullen.
fr: Votre token a expiré. Reconnectez-vous pour continuer à puller depuis GitHub.

# View.GitHubAccountSection.TokenExpires %@
source: Your token expires %@. Sign in again soon.
de: Dein Token läuft %@ ab. Melde dich bald erneut an.
fr: Votre token expire %@. Reconnectez-vous bientôt.

# View.GitHubAccountSection.UnknownTokenTypeDoesn
source: Unknown — this token type doesn't report scopes
de: Unbekannt — dieser Tokentyp meldet keine Scopes
fr: Inconnu — ce type de token ne signale pas de scopes

# View.GitHubAccountSection.UsedByCodebases %lld
source: Used by %lld codebases
de: Von %lld Codebases verwendet
fr: Utilisé par %lld codebases

# View.GitHubAccountSection.WeLlGenerateShort
source: We'll generate a short code, copy it to your clipboard, and open github.com
de: Wir erstellen einen kurzen Code, kopieren ihn in deine Zwischenablage und öffnen github.com
fr: Nous allons générer un code court, le copier dans votre presse-papiers, puis ouvrir github.com

# View.GitHubScopeGateModifier.MissingScopes %@
source: This needs additional GitHub permissions: %@. Re-authorize to continue.
de: Dafür sind zusätzliche GitHub-Berechtigungen erforderlich: %@. Erneut autorisieren, um fortzufahren.
fr: Cela nécessite des autorisations GitHub supplémentaires : %@. Réautorisez pour continuer.

# View.GitHubScopeGateModifier.ReAuthorize
source: Re-authorize
de: Erneut autorisieren
fr: Réautoriser

# View.GitHubScopeGateModifier.UnknownScopes
source: Açaí can't tell which permissions your GitHub token has. Re-authorize to continue.
de: Açaí kann nicht feststellen, welche Berechtigungen dein GitHub-Token hat. Erneut autorisieren, um fortzufahren.
fr: Açaí ne parvient pas à déterminer quelles autorisations possède votre token GitHub. Réautorisez pour continuer.

# View.HotspotChartView.ChurnAxis
source: Churn (commits touching the file)
de: Churn (Commits, die die Datei berühren)
fr: Churn (commits touchant le fichier)

# View.HotspotChartView.ChurnComplexity %lld %lld
source: Churn %lld · Complexity %lld
de: Churn %lld · Komplexität %lld
fr: Churn %lld · Complexité %lld

# View.HotspotChartView.ComplexityAxis
source: Complexity (max cyclomatic)
de: Komplexität (max. zyklomatisch)
fr: Complexité (cyclomatique max.)

# View.HotspotChartView.CouldNotLoadGitHistory %@
source: Couldn't load git history: %@
de: Git-Historie konnte nicht geladen werden: %@
fr: Impossible de charger l'historique git : %@

# View.HotspotChartView.Done
source: Done
de: Fertig
fr: Terminé

# View.HotspotChartView.NoDataYet
source: No data yet.
de: Noch keine Daten.
fr: Aucune donnée pour le moment.

# View.HotspotChartView.NoFilesFallHotspot
source: No files fall in the hotspot quadrant (high churn and high complexity).
de: Keine Dateien liegen im Hotspot-Quadranten (hoher Churn und hohe Komplexität).
fr: Aucun fichier ne se trouve dans le quadrant des points chauds (churn élevé et complexité élevée).

# View.HotspotChartView.NoFilesToPlot
source: No files to plot yet — reindex the codebase first.
de: Noch keine Dateien zum Darstellen — indiziere die Codebase zuerst neu.
fr: Aucun fichier à tracer pour l'instant — réindexez d'abord la codebase.

# View.HotspotChartView.NoGitHistory
source: No git history available for this codebase — it isn't a git repository, or its repository hasn't been cloned yet.
de: Für diese Codebase ist keine Git-Historie verfügbar — sie ist kein Git-Repository, oder ihr Repository wurde noch nicht geklont.
fr: Aucun historique git disponible pour cette codebase — ce n'est pas un repository git, ou son repository n'a pas encore été cloné.

# View.HotspotChartView.Sidebar
source: Sidebar
de: Seitenleiste
fr: Barre latérale

# View.HotspotChartView.ToggleRankedHotspotList
source: Toggle the ranked hotspot list
de: Rangliste der Hotspots umschalten
fr: Afficher ou masquer la liste des points chauds classés

# View.HotspotChartView.WalkingCommitHistory
source: Walking commit history…
de: Commit-Verlauf wird durchlaufen …
fr: Parcours de l'historique des commits…

# View.KeyboardShortcutsHelpMenuButton.KeyboardShortcuts
source: Keyboard Shortcuts
de: Tastaturbefehle
fr: Raccourcis clavier

# View.KeyboardShortcutsPanel.Done
source: Done
de: Fertig
fr: Terminé

# View.KeyboardShortcutsPanel.KeyboardShortcuts
source: Keyboard Shortcuts
de: Tastaturbefehle
fr: Raccourcis clavier

# View.LayersEditor.AddLayer
source: Add layer
de: Schicht hinzufügen
fr: Ajouter une couche

# View.LayersEditor.AllowSkippingLayers
source: Allow skipping layers
de: Überspringen von Schichten erlauben
fr: Autoriser le saut de couches

# View.LayersEditor.EnforceLayering
source: Enforce layering
de: Schichtung erzwingen
fr: Faire respecter les couches

# View.LayersEditor.LayerNameEG
source: Layer name (e.g. UI)
de: Schichtname (z. B. UI)
fr: Nom de la couche (par ex. UI)

# View.LayersEditor.LayersTopHighestLevel
source: Layers from top (highest level) to bottom.
de: Schichten von oben (höchste Ebene) nach unten.
fr: Couches classées du haut (niveau le plus élevé) vers le bas.

# View.LayersEditor.Matches
source: Matches
de: Trifft zu auf
fr: Correspond à

# View.LicensesSection.License %@ %@
source: %@, %@ license
de: %@, %@-Lizenz
fr: %@, licence %@

# View.LicensesSection.SomethingWentWrong
source: Something went wrong
de: Etwas ist schiefgelaufen
fr: Une erreur s'est produite

# View.MCPConnectionSection.AçaíSMCPServer
source: Açaí's MCP server exposes this same read-only analysis engine — quality
de: Açaís MCP-Server stellt dieselbe schreibgeschützte Analyse-Engine bereit — Qualität
fr: Le serveur MCP d'Açaí expose ce même moteur d'analyse en lecture seule — qualité

# View.MCPConnectionSection.Copy
source: Copy
de: Kopieren
fr: Copier

# View.MCPConnectionSection.CopyMCPServerConfiguration
source: Copy MCP server configuration
de: MCP-Serverkonfiguration kopieren
fr: Copier la configuration du serveur MCP

# View.MCPConnectionSection.FoundInstalledServer %@
source: Found an installed server at %@.
de: Installierter Server gefunden unter %@.
fr: Serveur installé trouvé à %@.

# View.MCPConnectionSection.NoInstalledBinaryFound
source: No installed acai-mcp binary was found. Build one with "swift build --product AcaiMCP", then run Scripts/mcp_install.sh to install it at the path below — or edit the snippet to point at .build/debug/AcaiMCP for a local build.
de: Es wurde keine installierte acai-mcp-Binary gefunden. Erstelle eine mit "swift build --product AcaiMCP" und führe anschließend Scripts/mcp_install.sh aus, um sie am unten stehenden Pfad zu installieren — oder bearbeite den Codeausschnitt, damit er für einen lokalen Build auf .build/debug/AcaiMCP verweist.
fr: Aucun binaire acai-mcp installé n'a été trouvé. Compilez-en un avec "swift build --product AcaiMCP", puis exécutez Scripts/mcp_install.sh pour l'installer au chemin ci-dessous — ou modifiez l'extrait pour qu'il pointe vers .build/debug/AcaiMCP pour une compilation locale.

# View.MCPConnectionSection.PasteUnderMcpServersClaude
source: Paste this under "mcpServers" in Claude Desktop's claude_desktop_config.json
de: Füge dies unter "mcpServers" in Claude Desktops claude_desktop_config.json ein
fr: Collez ceci sous "mcpServers" dans le fichier claude_desktop_config.json de Claude Desktop

# View.MemberFlagsFields.Abstract
source: Abstract
de: Abstrakt
fr: Abstrait

# View.MemberFlagsFields.AccessLevel
source: Access Level
de: Zugriffsebene
fr: Niveau d'accès

# View.MemberFlagsFields.Static
source: Static
de: Statisch
fr: Statique

# View.MethodEditorSheet.Cancel
source: Cancel
de: Abbrechen
fr: Annuler

# View.MethodEditorSheet.Parameters
source: Parameters
de: Parameter
fr: Paramètres

# View.MethodEditorSheet.ReturnType
source: Return Type
de: Rückgabetyp
fr: Type de retour

# View.MethodEditorSheet.Save
source: Save
de: Speichern
fr: Enregistrer

# View.ModuleCouplingChartView.Done
source: Done
de: Fertig
fr: Terminé

# View.ModuleCouplingChartView.Modules
source: Modules
de: Module

# View.ModuleCouplingChartView.NoModulesPlotYet
source: No modules to plot yet — reindex the codebase first.
de: Noch keine Module zum Darstellen — Codebase zuerst neu indizieren.
fr: Aucun module à tracer pour le moment — réindexez d'abord la codebase.

# View.ModuleCouplingChartView.Sidebar
source: Sidebar
de: Seitenleiste
fr: Barre latérale

# View.ModuleCouplingChartView.ToggleRankedModuleList
source: Toggle the ranked module list
de: Rangliste der Module umschalten
fr: Afficher ou masquer la liste des modules classés

# View.MultiSelectToggleButton.Select
source: Select
de: Auswählen
fr: Sélectionner

# View.MultiSelectToggleButton.ToggleMultiSelectMode
source: Toggle multi-select mode: tap nodes to add or remove them from the selection
de: Mehrfachauswahl-Modus umschalten: Tippe auf Knoten, um sie der Auswahl hinzuzufügen oder daraus zu entfernen
fr: Activer ou désactiver le mode de sélection multiple : touchez les nœuds pour les ajouter à la sélection ou les en retirer

# View.NewCodebaseSheet.Add
source: Add
de: Hinzufügen
fr: Ajouter

# View.NewCodebaseSheet.AddCodebase
source: Add Codebase
de: Codebase hinzufügen
fr: Ajouter une codebase

# View.NewCodebaseSheet.AlreadyClonedLocally
source: Already cloned locally — adding this codebase will be fast.
de: Lokal bereits geklont — diese Codebase hinzuzufügen geht schnell.
fr: Déjà cloné localement — l'ajout de cette codebase sera rapide.

# View.NewCodebaseSheet.Cancel
source: Cancel
de: Abbrechen
fr: Annuler

# View.NewCodebaseSheet.Choose
source: Choose…
de: Auswählen…
fr: Choisir…

# View.NewCodebaseSheet.Cloning
source: Cloning…
de: Wird geklont…
fr: Clonage…

# View.NewCodebaseSheet.Directory
source: Directory
de: Verzeichnis
fr: Répertoire

# View.NewCodebaseSheet.EGMyLibrary
source: e.g. MyLibrary
de: z. B. MyLibrary
fr: par ex. MyLibrary

# View.NewCodebaseSheet.NoDirectoryChosen
source: No directory chosen
de: Kein Verzeichnis gewählt
fr: Aucun répertoire choisi

# View.NewCodebaseSheet.None
source: None
de: Keine
fr: Aucun

# View.NewCodebaseSheet.OpenSettings
source: Open Settings
de: Einstellungen öffnen
fr: Ouvrir Réglages

# View.NewCodebaseSheet.Search
source: Search
de: Suchen
fr: Rechercher

# View.NewCodebaseSheet.SearchRepositories
source: Search repositories
de: Repositories durchsuchen
fr: Rechercher des repositories

# View.NewCodebaseSheet.Signed %@
source: Signed in as %@
de: Angemeldet als %@
fr: Connecté en tant que %@

# View.NewCodebaseSheet.SignGitHubSettings
source: Sign in to GitHub in Settings
de: Melde dich in den Einstellungen bei GitHub an
fr: Connectez-vous à GitHub dans Réglages

# View.NewCodebaseSheet.Source
source: Source
de: Quelle

# View.NewProjectSheet.Cancel
source: Cancel
de: Abbrechen
fr: Annuler

# View.NewProjectSheet.Create
source: Create
de: Erstellen
fr: Créer

# View.NewProjectSheet.EGMyProject
source: e.g. My Project
de: z. B. Mein Projekt
fr: par ex. Mon Projet

# View.NewProjectSheet.NewProject
source: New Project
de: Neues Projekt
fr: Nouveau projet

# View.NewProjectSheet.Subtitle
source: Subtitle
de: Untertitel
fr: Sous-titre

# View.NewProjectSheet.Title
source: Title
de: Titel
fr: Titre

# View.NoteNodeView.EmptyNote
source: (empty note)
de: (leere Notiz)
fr: (note vide)

# View.PackageDiagramInspector.DependedOnBy %lld
source: Depended On By (%lld)
de: Wird benötigt von (%lld)
fr: Dont dépendent (%lld)

# View.PackageDiagramInspector.DependsOn %lld
source: Depends On (%lld)
de: Hängt ab von (%lld)
fr: Dépend de (%lld)

# View.PackageDiagramInspector.DistanceFromMainSeq
source: Distance from main seq.
de: Distanz zur Hauptsequenz
fr: Distance à la séq. principale

# View.PackageDiagramInspector.FillDistanceMainSequence
source: Fill = distance from the main sequence
de: Füllung = Abstand von der Main Sequence
fr: Remplissage = distance par rapport à la main sequence

# View.PackageDiagramInspector.GreenBalancedRedZone
source: green = balanced · red = zone of pain / uselessness
de: grün = ausgeglichen · rot = Zone of Pain / Uselessness
fr: vert = équilibré · rouge = zone of pain / uselessness

# View.PackageDiagramInspector.ModuleInflectTrueSelected %lld
source: ^[%lld Module](inflect: true) Selected
de: ^[%lld Modul](inflect: true) ausgewählt
fr: ^[%lld module](inflect: true) sélectionné

# View.PackageDiagramInspector.SelectModuleInspect
source: Select a module to inspect
de: Modul zum Überprüfen auswählen
fr: Sélectionner un module à inspecter

# View.PackageDiagramInspector.Types %lld
source: %lld types
de: %lld Typen

# View.PackageDiagramSidebar.Export
source: Export
de: Exportieren
fr: Exporter

# View.PackageDiagramSidebar.ExportDiagramImage
source: Export the diagram as an image
de: Diagramm als Bild exportieren
fr: Exporter le diagramme sous forme d'image

# View.PackageDiagramSidebar.ExportImage
source: Export Image
de: Bild exportieren
fr: Exporter l'image

# View.PackageDiagramSidebar.Inspector
source: Inspector
de: Inspektor
fr: Inspecteur

# View.PackageDiagramSidebar.SaveCopyEditableFreeform
source: Save a copy as an editable Freeform diagram
de: Kopie als bearbeitbares Freeform-Diagramm speichern
fr: Enregistrer une copie sous forme de diagramme Freeform modifiable

# View.PackageDiagramSidebar.SaveFreeform
source: Save as Freeform
de: Als Freeform speichern
fr: Enregistrer en tant que Freeform

# View.PackageDiagramSidebar.Settings
source: Settings
de: Einstellungen
fr: Réglages

# View.PackageDiagramView.Done
source: Done
de: Fertig
fr: Terminé

# View.PackageDiagramView.FitDiagramVisibleCanvas
source: Fit the diagram to the visible canvas (⌘0)
de: Diagramm an die sichtbare Zeichenfläche anpassen (⌘0)
fr: Ajuster le diagramme à la zone visible (⌘0)

# View.PackageDiagramView.FitView
source: Fit to View
de: An Ansicht anpassen
fr: Ajuster à la vue

# View.PackageDiagramView.PackageDiagram
source: Package Diagram
de: Paketdiagramm
fr: Diagramme de packages

# View.PackageDiagramView.Sidebar
source: Sidebar
de: Seitenleiste
fr: Barre latérale

# View.PackageDiagramView.ToggleSidebar
source: Toggle the sidebar
de: Seitenleiste ein-/ausblenden
fr: Afficher ou masquer la barre latérale

# View.ParameterListEditor.AddParameter
source: Add Parameter
de: Parameter hinzufügen
fr: Ajouter un paramètre

# View.ParameterListEditor.Type
source: Type
de: Typ

# View.ParseHealthSection.NoDiagnostics %lld %@
source: Parse health %1$lld%% — no diagnostics across %2$@.
de: Parse-Zustand %1$lld %% — keine Diagnosen über %2$@.
fr: Santé de l'analyse %1$lld %% — aucun diagnostic sur %2$@.

# View.ParseHealthSection.ParseHealth
source: Parse Health
de: Parse-Zustand
fr: Santé de l'analyse

# View.ParseHealthSection.ScoreWithDiagnostics %lld %lld
source: %1$lld%% · %lld diagnostics
de: %1$lld %% · %lld Diagnosen

# View.ParseHealthSection.Types %lld
source: %lld types
de: %lld Typen

# View.ProjectBrowserView.ConfirmDeleteCodebase %@
source: Delete "%@"?
de: „%@“ löschen?
fr: Supprimer "%@" ?

# View.ProjectBrowserView.ConfirmDeleteProject %@
source: Delete "%@"?
de: „%@“ löschen?
fr: Supprimer "%@" ?

# View.ProjectBrowserView.DeleteCodebase
source: Delete Codebase
de: Codebase löschen
fr: Supprimer la codebase

# View.ProjectBrowserView.DeleteProject
source: Delete Project
de: Projekt löschen
fr: Supprimer le projet

# View.ProjectBrowserView.DeletesAllCodebasesDiagrams
source: This deletes all of its codebases and diagrams. This cannot be undone.
de: Dadurch werden alle zugehörigen Codebases und Diagramme gelöscht. Dies kann nicht rückgängig gemacht werden.
fr: Cela supprime toutes ses codebases et tous ses diagrammes. Cette action est irréversible.

# View.ProjectBrowserView.DeletesDiagramsCachedAnalysis
source: This deletes its diagrams and cached analysis. This cannot be undone.
de: Dadurch werden seine Diagramme und die zwischengespeicherte Analyse gelöscht. Dies kann nicht rückgängig gemacht werden.
fr: Cela supprime ses diagrammes et l'analyse mise en cache. Cette action est irréversible.

# View.ProjectBrowserView.DiagramNotFound
source: Diagram not found
de: Diagramm nicht gefunden
fr: Diagramme introuvable

# View.ProjectBrowserView.DiagramTheme
source: Diagram Theme
de: Diagramm-Theme
fr: Thème du diagramme

# View.ProjectBrowserView.KeyboardShortcuts
source: Keyboard Shortcuts
de: Tastaturbefehle
fr: Raccourcis clavier

# View.ProjectBrowserView.NewProject
source: New project
de: Neues Projekt
fr: Nouveau projet

# View.ProjectBrowserView.NoAnalysisAvailableReindex
source: No analysis available. Reindex the codebase first.
de: Keine Analyse verfügbar. Codebase zuerst neu indizieren.
fr: Aucune analyse disponible. Réindexez d'abord la codebase.

# View.ProjectBrowserView.Projects
source: Projects
de: Projekte
fr: Projets

# View.ProjectBrowserView.QuickOpen
source: Quick Open
de: Schnell öffnen
fr: Ouverture rapide

# View.ProjectBrowserView.SelectProjectDiagram
source: Select a project or diagram
de: Projekt oder Diagramm auswählen
fr: Sélectionner un projet ou un diagramme

# View.ProjectBrowserView.Settings
source: Settings
de: Einstellungen
fr: Réglages

# View.ProjectDetailView.Add
source: Add
de: Hinzufügen
fr: Ajouter

# View.ProjectDetailView.AddCodebase
source: Add codebase
de: Codebase hinzufügen
fr: Ajouter une codebase

# View.ProjectDetailView.ConfirmDeleteCodebase %@
source: Delete "%@"?
de: „%@“ löschen?
fr: Supprimer "%@" ?

# View.ProjectDetailView.ConfirmDeleteProject %@
source: Delete "%@"?
de: „%@“ löschen?
fr: Supprimer "%@" ?

# View.ProjectDetailView.Delete
source: Delete
de: Löschen
fr: Supprimer

# View.ProjectDetailView.DeleteCodebase
source: Delete Codebase
de: Codebase löschen
fr: Supprimer la codebase

# View.ProjectDetailView.DeleteProject
source: Delete Project
de: Projekt löschen
fr: Supprimer le projet

# View.ProjectDetailView.DeletesAllCodebasesDiagrams
source: This deletes all of its codebases and diagrams. This cannot be undone.
de: Dadurch werden alle zugehörigen Codebases und Diagramme gelöscht. Dies kann nicht rückgängig gemacht werden.
fr: Cela supprime toutes ses codebases et tous ses diagrammes. Cette action est irréversible.

# View.ProjectDetailView.DeletesDiagramsCachedAnalysis
source: This deletes its diagrams and cached analysis. This cannot be undone.
de: Dadurch werden seine Diagramme und die zwischengespeicherte Analyse gelöscht. Dies kann nicht rückgängig gemacht werden.
fr: Cela supprime ses diagrammes et l'analyse mise en cache. Cette action est irréversible.

# View.ProjectDetailView.Diagrams
source: Diagrams
de: Diagramme
fr: Diagrammes

# View.ProjectDetailView.NoCodebasesYetAdd
source: No codebases yet. Add one above.
de: Noch keine Codebases. Füge oben eine hinzu.
fr: Aucune codebase pour le moment. Ajoutez-en une ci-dessus.

# View.ProjectDetailView.NoCodebasesYetTap
source: No codebases yet. Tap **+** to add one.
de: Noch keine Codebases. Tippe auf **+**, um eine hinzuzufügen.
fr: Aucune codebase pour le moment. Touchez **+** pour en ajouter une.

# View.ProjectDetailView.NoFreeformDiagramsYet
source: No freeform diagrams yet. Create one above.
de: Noch keine Freeform-Diagramme. Erstelle oben eines.
fr: Aucun diagramme Freeform pour le moment. Créez-en un ci-dessus.

# View.ProjectDetailView.NoFreeformDiagramsYetTouch
source: No freeform diagrams yet. Tap **+** to add one.
de: Noch keine Freeform-Diagramme. Tippe auf **+**, um eines hinzuzufügen.
fr: Aucun diagramme Freeform pour le moment. Touchez **+** pour en ajouter un.

# View.ProjectDetailView.ProjectDescription
source: Project Description
de: Projektbeschreibung
fr: Description du projet

# View.ProjectDetailView.ProjectName
source: Project Name
de: Projektname
fr: Nom du projet

# View.ProjectDetailView.Reindex
source: Reindex
de: Neu indizieren
fr: Réindexer

# View.ProjectDetailView.SelectProjectDiagram
source: Select a project or diagram
de: Projekt oder Diagramm auswählen
fr: Sélectionner un projet ou un diagramme

# View.PropertyEditorSheet.Cancel
source: Cancel
de: Abbrechen
fr: Annuler

# View.PropertyEditorSheet.Save
source: Save
de: Speichern
fr: Enregistrer

# View.PropertyEditorSheet.Type
source: Type
de: Typ

# View.QualityCheckEditorSheet.Cancel
source: Cancel
de: Abbrechen
fr: Annuler

# View.QualityCheckEditorSheet.Choose
source: Choose…
de: Auswählen…
fr: Choisir…

# View.QualityCheckEditorSheet.ChooseYAMLRulesFile
source: Choose a YAML rules file to validate this codebase against.
de: Wähle eine YAML-Regeldatei, gegen die diese Codebase geprüft wird.
fr: Choisissez un fichier de règles YAML pour valider cette codebase.

# View.QualityCheckEditorSheet.CodeQualityCheck
source: Code Quality Check
de: Codequalitätsprüfung
fr: Contrôle de qualité du code

# View.QualityCheckEditorSheet.CouldNotLoadRules %@
source: Could not load rules: %@
de: Regeln konnten nicht geladen werden: %@
fr: Impossible de charger les règles : %@

# View.QualityCheckEditorSheet.DefinedHere
source: Defined here
de: Hier definiert
fr: Défini ici

# View.QualityCheckEditorSheet.ExternalYAMLFile
source: External YAML file
de: Externe YAML-Datei
fr: Fichier YAML externe

# View.QualityCheckEditorSheet.NoFileSelected
source: No file selected
de: Keine Datei gewählt
fr: Aucun fichier sélectionné

# View.QualityCheckEditorSheet.Preview
source: Preview
de: Vorschau
fr: Aperçu

# View.QualityCheckEditorSheet.Rules
source: Rules
de: Regeln
fr: Règles

# View.QualityCheckEditorSheet.Save
source: Save
de: Speichern
fr: Enregistrer

# View.QualityCheckReportView.FindingSAcrossRule %lld %lld
source: %lld findings across %lld rules
de: %lld Findings in %lld Regeln
fr: %lld findings sur %lld règles

# View.QualityCheckReportView.NoRulesDefined
source: No rules defined yet — add at least one rule to check this codebase.
de: Noch keine Regeln definiert — füge mindestens eine Regel hinzu, um diese Codebase zu prüfen.
fr: Aucune règle définie — ajoutez au moins une règle pour contrôler cette codebase.

# View.QualityCheckReportView.QualityOK %lld
source: Quality OK — %lld rules checked, no violations.
de: Qualität OK — %lld Regeln geprüft, keine Verstöße.
fr: Qualité OK — %lld règles contrôlées, aucune violation.

# View.QualityCheckSection.BuiltInBudgets %@
source: Built-in smell budgets · %@
de: Eingebaute Smell-Budgets · %@
fr: Budgets de smells intégrés · %@

# View.QualityCheckSection.CodeQualityCheck
source: Code Quality Check
de: Codequalitätsprüfung
fr: Contrôle de qualité du code
